Revit 2027 API
InitialColor Methods
The InitialColor type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the InitialColor derived object.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace